const { exec } = require('child_process')
const commitMessages = ["✌","😂","😝","😁","😱","👉","🙌","🍻","🔥","🌈","☀","🎈","🌹","💄","🎀","⚽","🎾","🏁","😡","👿","🐻","🐶","🐬","🐟","🍀","👀","🚗","🍎","💝","💙","👌","❤","😍","😉","😓","😳","💪","💩","🍸","🔑","💖","🌟","🎉","🌺","🎶","👠","🏈","⚾","🏆","👽","💀","🐵","🐮","🐩","🐎","💣","👃","👂","🍓","💘","💜","👊","💋","😘","😜","😵","🙏","👋","🚽","💃","💎","🚀","🌙","🎁","⛄","🌊","⛵","🏀","🎱","💰","👶","👸","🐰","🐷","🐍","🐫","🔫","👄","🚲","🍉","💛","💚"]

const getRandMessage = () => { return commitMessages[Math.floor((Math.random()*commitMessages.length))] }

const message = process.argv[2] || getRandMessage()

exec(`git add -A && git commit -m "${message}"`, (err, stdout, stderr) => {
    if (err) {
      console.log(`${err}`)
      return
    }
    console.log(`${stdout}`)
  });